{"pageProps":{"portfolioData":[{"id":"sakentry","contentHtml":"<p>This project is an active personal project of mine and its first version is planned <strong>to be released on App Store by March/April, 2021</strong>.</p>\n<p>Sakentry is an iOS app that allows users to find, learn and review Sake, Japanese alcoholic beverage, just like we use Vivino for wine. Its features include to find sakes in the database through free word search and filtering, upload reviews and take notes on sakes with pictures, and communicate with other users by liking and commenting on their reviews.</p>\n<p>Programming languages and tools used in this project include: <strong>Swift, Python, Typescript, Xcode, Firebase, Algolia</strong></p>\n","title":"Sakentry","date":"2021-02-16","image":"project_image/sakentry.png"},{"id":"gmap-retrieval","contentHtml":"<p>gmap-retrieval is a Python package I developed as a part of my work at <span style=\"color: blue; \"><a href=\"https://www.dsgelab.org/\">Genetic Epidemiology Lab of Andrea Ganna, PhD</a></span>.</p>\n<p>This package consists of multiple wrapper functions, which internally calls Google APIs, and allows users easily retrieve pre-processed geographical data such as Google Street View images, satellite images and place data from Google Map. This API was developed for the purpose of collecting geographical data of individuals in biobank datasets in research contexts.</p>\n<p>Programming languages and tools used in this project include: <strong>Python, Google Cloud Console, Google API</strong></p>\n<p>Check <span style=\"color: blue; \"><a href=\"https://github.com/dsgelab/gmap-retrieval\">GitHub repo</a></span></p>\n","title":"gmap-retrieval","date":"2020-08-31","image":"project_image/gmap_retrieval.png"},{"id":"mypage","contentHtml":"<p>This is the webpage you're at right now, my personal website.</p>\n<p>Programming languages and tools used in this project include: <strong>Javascript, HTML, CSS, Next.js, GitHub Pages</strong></p>\n<p>Check <span style=\"color: blue; \"><a href=\"https://github.com/tshimizu97/tshimizu97.github.io\">GitHub repo</a></span></p>\n","title":"Personal Website","date":"2020-01-01","image":"project_image/mypage.png"}]},"__N_SSG":true}